Lab_01/tail_latency_docker_results.txt
This is ApacheBench, Version 2.3 <$Revision: 1923142 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient).....done


Server Software:        Werkzeug/3.1.8
Server Hostname:        localhost
Server Port:            5001

Document Path:          /
Document Length:        27 bytes

Concurrency Level:      10
Time taken for tests:   1.633 seconds
Complete requests:      100
Failed requests:        0
Total transferred:      20100 bytes
HTML transferred:       2700 bytes
Requests per second:    61.23 [#/sec] (mean)
Time per request:       163.323 [ms] (mean)
Time per request:       16.332 [ms] (mean, across all concurrent requests)
Transfer rate:          12.02 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.1      0       1
Processing:    13  101  97.5     63     613
Waiting:        2   90  97.3     52     602
Total:         13  101  97.5     63     613

Percentage of the requests served within a certain time (ms)
  50%     63
  66%    106
  75%    144
  80%    165
  90%    218
  95%    271
  98%    410
  99%    613
 100%    613 (longest request)